{"Patient_demographics":["Name: Not provided","Unit No: Not provided","Admission Date: Not provided","Discharge Date: Not provided","Date of Birth: Not provided","Sex: F","Service: MEDICINE"],"Chief_complaint_and_Discharge_Diagnoses":["Chief Complaint: Weakness, nausea/vomiting","Discharge Diagnosis: Metastatic disease of unknown primary: Weakness and nausea likely from tumor burden"],"Allergy_history_past_medical_history":["Allergies: Sulfa (Sulfonamide Antibiotics), Codeine, Bactrim","Past Medical History: # high grade SBO ___ s/p exploratory laparotomy, lysis of adhesions, and small bowel resection with enteroenterostomy, # carcinoid, # hyperlipidemia, # vitamin B12 deficiency, # cervical DJD, # osteoarthritis","PSH: s/p R lung resection in ___ at ___, s/p hysterectomy in ___, s/p R arm surgery"],"Current_medications":["Medications on Admission: 1. Albuterol Inhaler ___ PUFF IH Q6H:PRN SOB, 2. BuPROPion 150 mg PO DAILY, 3. Gabapentin 300 mg PO HS, 4. Sertraline 200 mg PO DAILY, 5. Simvastatin 40 mg PO DAILY, 6. traZODONE 100 mg PO HS:PRN sleep, 7. Ibuprofen 800 mg PO Q12H:PRN pain, 8. Hydrochlorothiazide 12.5 mg PO DAILY, 9. Ondansetron 4 mg PO Q8H:PRN nausea","Discharge Medications: See above for detailed list of medications upon discharge"],"Social_history_and_family_history":["Social History: Not provided","Family History: Mother - ___ cancer d. at ___, Youngest of ___ - not in touch with siblings, Father - ___ d. at ___"],"History_of_present_illness":["This is a ___ yo f with h/o recently diagnosed metastatic cancer of unknown prior presenting with nausea, vomiting, and fever to 101 today. Patient has been vomiting over the past 6 - 8 weeks, since before she was diagnosed with metastatic cancer. She also reports pain over her upper abdomen and has very poor PO intake. She has been feeling progressively weak over this time period. Her vomiting and abdominal pain has not increased from the past weeks, but she just feels more fatigued. She has a chronic non-productive cough as well. No URI symptoms, no urinary complaints. She has been constipated, which improves when she stops her anti-emetics. Last bowel movement was yesterday. She is passing gas. She has lower extremity edema, which has been present for the past several weeks."],"Inspection_findings":["Admission Physical Exam: Detailed physical examination findings provided","Discharge Physical Exam: Detailed physical examination findings provided","Pertinent Results: Detailed summary of lab results and imaging findings"],"Other_relevant_information_before_the_admission":["Brief Hospital Course: Detailed summary of the hospital stay and management provided"]}