{"Chief_Complaint":"Shortness of breath","Allergies":["lisinopril"],"History_of_Present_Illness":["Ms. ___ is an ___ year old woman with a hx of HTN, HLD, Grave's disease, discoid lupus (in remission x ___ years) who presents with pericardial effusion causing tamponade physiology now s/p pericardiocentesis. She was in her usual state of health until 3 weeks ago when she experienced 2 days of fever/chills, feeling generally unwell after getting a flu shot. She felt better on the third day and was doing well until this weekend when she experienced similar symptoms, which she took Tylenol for. She was also experiencing intermittent palpitations and worsening shortness of breath but no chest pain. She expected her symptoms to resolve but they did not so she presented to her PCP office on ___ and they told her to seek evaluation at ___ on ___. In the ___ she was found to be tachycardic with an irregular rhythm, although there was some uncertainty whether this was sinus with ectopy vs afib. SBPs were initially 130s-140s. CXR showed large cardiac sillhouette and small ___ effusions. CT obtained to r/o PE showed 2.2-2.7 cm pericardial effusion. Pulsus pardoxus was measured by ___ at 15. Dr ___ thoracic surgery was consulted in the ___ and did not feel that the patient required emergent pericardiocentesis. The patient stayed in the ___ overnight as no tertiary care beds were available. O/n the patient received 5 mg IV lopressor her HRs trended down slightly and her dyspnea improved somewhat. Stable this am on RA. Bedside ECHO done with 2.1 cm effusion with some fibrin noted, EF 70%, PASP 36, some collapse of RA/RV and resp variation across the TV. She was transferred to ___ and underwent successful pericardiocentesis with 230cc of fluid drained, pericardial drain placed and then transferred to the CCU for further management. On arrival to the CCU, patient states that she is feeling much better than before but is having some soreness at the site of the drain placement. Otherwise she denies chest pain, current shortness of breath, fever, chills, nausea, vomiting, diarrhea, leg swelling, dysuria."],"Past_Medical_History":["HTN","HLD","Grave's disease - s/p treatment ___ years ago","Discoid lupus - 20+ years ago, no problems since"],"Social_history":["___"],"Family_history":["No family history of early MI, arrhythmia, cardiomyopathies, or sudden cardiac death. Both of her parents died of strokes in their ___. History of Grave's disease in her sisters and one daughter. History of lupus in her sister."],"Physical_Exam":["ADMISSION PHYSICAL EXAM ======================== VS: BP 111/63 HR 112 RR 29 O2 SAT 97% on 2L NC GENERAL: Well developed, well nourished in NAD. Oriented x3. Mood, affect appropriate. HEENT: Normocephalic atraumatic. Sclera anicteric. PERRL. EOMI. Conjunctiva were pink. No pallor or cyanosis of the oral mucosa. No xanthelasma. NECK: Supple. CARDIAC/CHEST: Tachycardic. Normal S1, S2. No murmurs, rubs, or gallops. There is a pericardial drain inserting just below the sternum in place with a few mls of ser..."],"Medications_on_Admissions":["The Preadmission Medication list is accurate and complete.","1. Losartan Potassium 20 mg PO DAILY","2. Atorvastatin 20 mg PO QPM","3. Aspirin 81 mg PO DAILY","4. Vitamin D Dose is Unknown PO DAILY","5. Multivitamins 1 TAB PO DAILY","6. amLODIPine 5 mg PO DAILY"],"Discharge_Diagnose":["PRIMARY DIAGNOSIS =================== Pericardial effusion Sinus tachycardia Hyponatremia Acute kidney injury SECONDARY DIAGNOSIS =================== Hypertension Hyperlipidemia"],"Discharge_Medications":["1. Vitamin D 800 UNIT PO DAILY","2. amLODIPine 5 mg PO DAILY","3. Aspirin 81 mg PO DAILY","4. Atorvastatin 20 mg PO QPM","5. Multivitamins 1 TAB PO DAILY","6. HELD- Losartan Potassium 20 mg PO DAILY This medication was held. Do not restart Losartan Potassium until discussing with your doctor."],"Other_Discharge_Information":["Ms. ___ is an ___ year old woman with a hx of HTN, HLD, Grave's disease, discoid lupus (in remission x ___ years) who presented with pericardial effusion causing tamponade physiology now s/p successful pericardiocentesis with persistent mild sinus tachycardia thought secondary to pericardial inflammation. Her home losartan was held in the setting of low blood pressure but was normotensive at the time of discharge, this should be held until recheck at PCP follow up. #Pericardial effusion now s/p ... "]}